W4D4/MusicBuddy/app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
  def destroy
      @band = Band.find_by(id: params[:id])
      @band.destroy

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @band = Band.find_by(id: params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Gatos Locos Supreme"], ["updated_at", "2019-05-02 20:46:44.235665"], ["id", 2]]
---
  def update
    @band = Band.find_by(id: params[:id])

    if @band
      @band.update(band_params)