W4D2/NinetyNineCats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("created_at", "updated_at", "birth_date", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "blue"], ["updated_at", "2019-04-30 21:05:28.588948"], ["id", 2]]
---
    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update(cat_params)