W4D4/MusicBuddy/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hello@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        user = self.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "kv9bSQUrLAM6SxS5P3B-_A"], ["updated_at", "2019-05-02 17:33:47.042481"], ["id", 1]]
---
    def reset_session_token!
        new_session_token = self.class.generate_session_token
        self.update!(session_token: new_session_token)